package people;

public class Question {
	
	/**
	 * Можем да дефинираме конструктор без параметри в класа Student
	 * Трябва обаче да извикаме суперския конструктор и да сложим някакви примерни стойности 
	 * Ако дефинираме такъв конструктор ще имаме възможност да създаваме обекти от класа по два начина
	 * При използване на конструктор без параметри създаденият обект приема стойностите, които сме подали
	 * при създаването на конструктора
	 * 
	 * 	Student(){
	 *	 super("", 0, false);
	 *	}
	 *
	 */

}
